from core.constants import (
    APT_TOKEN,
    USDC_TOKEN,
    USDT_TOKEN,
    ALT_TOKEN,
    THL_TOKEN,
    WETH_TOKEN,
    TAPT_TOKEN,
    DITTO_TOKEN,
    SOL_TOKEN,
    THAPT_TOKEN,
    AMNIS_TOKEN
)

##############################################################################################
########################################### TOKENS ###########################################
##############################################################################################

# Токены для свапов и сборщика. Eсли токен не нужен, то в начале строки поставьте "#".
TOKENS = {
    APT_TOKEN.symbol: APT_TOKEN,
    USDC_TOKEN.symbol: USDC_TOKEN,
    USDT_TOKEN.symbol: USDT_TOKEN,
    WETH_TOKEN.symbol: WETH_TOKEN,
    TAPT_TOKEN.symbol: TAPT_TOKEN,
    DITTO_TOKEN.symbol: DITTO_TOKEN,
    ALT_TOKEN.symbol: ALT_TOKEN,
    THL_TOKEN.symbol: THL_TOKEN,
    SOL_TOKEN.symbol: SOL_TOKEN,
    THAPT_TOKEN.symbol: THAPT_TOKEN,
    AMNIS_TOKEN.symbol: AMNIS_TOKEN
}

# Коэффициент потерь при свапе каждого токена (пример: 1 usdt = 1 * SLIPPAGE usdc будет после свапа).
TOKENS_SLIPPAGES = {
    APT_TOKEN: 0.99,
    USDC_TOKEN: 0.99,
    USDT_TOKEN: 0.99,
    WETH_TOKEN: 0.99,
    TAPT_TOKEN: 0.99,
    DITTO_TOKEN: 0.99,
    ALT_TOKEN: 0.99,
    THL_TOKEN: 0.99,
    SOL_TOKEN: 0.99,
    THAPT_TOKEN: 0.99,
    AMNIS_TOKEN: 0.99
}

# Нужно ли автоматически уменьшать слипадж, если транзакция из-за него не проходит
AUTODECREASE_SLIPPAGE = True

# Шаг автоматического уменьшения слипаджа
AUTODECREASE_SLIPPAGE_STEP = 0.01

# Токен для клейма с aptos bridge.
CLAIM_TOKEN = USDC_TOKEN

# Количество APT, которые должны остаться на кошельках после работы 13-го модуля (batch_trim_balance)
# Например, если на кошельке 0.9 APT, а значение переменной 0.6, на окх будет выведено 0.3 APT.

BALANCE_KEEP_AMOUNT_AFTER_TRIM = [0, 0]

##############################################################################################
########################################### GENERAL ##########################################
##############################################################################################

# Aptos RPC url.
RPC = "https://rpc.ankr.com/http/aptos/v1"

# Нужно ли автоматически делать свап, если не хватает определенного токена для действия
AUTOSWAP = True

# Количество цифр после запятой в случае округления.
ROUND_TO = 5

# Количество попыток, в случае ошибки. Не ставить меньше 3 попыток.
ATTEMPTS_COUNT = 5

# Количество процентов от токена, которые будут использованы для свапа.
SWAP_DEVIATION = [0.1, 0.2]

# Минимальное количество APT на кошельке. Модуль 2 удалит из бд этот кошелек. Модуль 3 выведет на этот кошелек APT.
MIN_GAS_BALANCE = 0.01

# Ключ от "https://rucaptcha.com/ для решения капчи Aptos names".
CAPTCHA_KEY = ""

# Время в секундах ожидания между транзакциями (кошельками).
SLEEP_TIME = [5, 10]

# API ключ от Moralis, используется для sub aptos name и aptos name update.
MORALIS_API_KEY = ""

# Количество APT, которое останется на кошельке при трансфере.
# Учитывайте то, что в это количество входит газ на трансфер.
WALLET_KEEP_AMOUNT = [0.00001, 0.00001]

##############################################################################################
####################################### TELEGRAM LOGS ########################################
##############################################################################################

# Если нужно отправлять логи в тг: True, если нет: False.
USE_TG_BOT = True

# Токен для телеграм бота.
TG_TOKEN = "6993062076:AAFMS1Gn6_F-mDSr-R7j41yLVbnnd1RAB0M"

# ID телеграм аккаунтов на которые нужно отправлять логи в бота.
TG_IDS = [224737994]

##############################################################################################
########################################## PROXIES ###########################################
##############################################################################################

# Если вы используете прокси: True, если нет: False.
USE_PROXY = False

# Если вы используете мобильные прокси: True, если нет: False. Если True, то USE_PROXY также True.
USE_MOBILE_PROXY = False

# Ссылка для смены ip мобильных прокси.
CHANGE_IP_URL = ""

##############################################################################################
########################################## TX COUNT ##########################################
##############################################################################################

# Нужно ли делать обратный свап в аптос сразу же, учтите, что тогда транзакций будет х2
USE_BACKSWAP = True

PANCAKESWAP_TX_COUNT = [46, 50]

LIQUIDSWAP_TX_COUNT = [46, 50]

SUSHISWAP_TX_COUNT = [4, 6]

THALASWAP_TX_COUNT = [4, 6]

TORTUGA_TX_COUNT = [0, 0]

AMNIS_TX_COUNT = [0, 0]

GATOR_DEPOSIT_TX_COUNT = [0, 0]

DITTO_TX_COUNT = [1, 2]

MERKLE_TX_COUNT = [0, 0]

BLUEMOVE_BID_TX_COUNT = [2, 4]

TOPAZ_BID_TX_COUNT = [0, 0]

WAPAL_BID_TX_COUNT = [0, 0]

# Пока доступен минт только одной NFT
WAPAL_MINT_TX_COUNT = [0, 0]

MERKATO_BID_TX_COUNT = [0, 0]

MERKATO_BUY_SELL_TX_COUNT = [0, 0]

SWAPGPT_TX_COUNT = [0, 0]

KANALABS_TX_COUNT = [0, 0]

ARIES_TX_COUNT = [0, 0]

APTOS_NAMES_TX_COUNT = [0, 0]

SUB_APTOS_NAMES_TX_COUNT = [0, 0]

# Количество транзакций в volume mode за один круг.
VOLUME_MODE_TX_COUNT = [6, 8]

##############################################################################################
######################################## STAKE/DEPOSIT AMOUNT ################################
##############################################################################################

# Количество токенов для стейка на tortuga (МИНИМУМ 0.01).
TORTUGA_STAKE_AMOUNT = [0, 0]

# Количество токенов для стейка на Amnis (МИНИМУМ 0.2).
AMNIS_STAKE_AMOUNT = [0, 0]

# Количество токенов для стейка на ditto.
DITTO_STAKE_AMOUNT = [0.001, 0.0015]

# Количество APT для депозита на SwapGPT (МИНИМУМ 0.5)
SWAPGPT_DEPOSIT_AMOUNT = [0, 0]

# Количество APT для депозита на KanaLabs (МИНИМУМ 0.5)
KANALABS_DEPOSIT_AMOUNT = [0, 0]

# Количество APT для депозита на Aries (МИНИМУМ 0.5)
ARIES_DEPOSIT_AMOUNT = [0, 0]

# Количество APT для ставок на NFT, рекомендуем ставить 0.001, но
# в случае ошибки EPRICE_IS_LOWER_THAN_ALL_BIDS_AND_HIT_MAX_BIDS поднять до 0.002 и т.д.

WAPAL_BID_AMOUNT = [0, 0]

TOPAZ_BID_AMOUNT = [0, 0]

BLUEMOVE_BID_AMOUNT = [0.001, 0.001]

MERKATO_BID_AMOUNT = [0, 0]

# Количество zUSDC для депозита на Gator
GATOR_DEPOSIT_AMOUNT = [0.1, 0.3]

# Количество zUSDC для открытия ордера на Merkle (МИНИМУМ 2.7 zUSDC), средства не будут утеряны
MERKLE_ORDER_AMOUNT = [2.7, 2.7]

##############################################################################################
############################################ OKX #############################################
##############################################################################################

# Количество APT для вывода с OKX на кошелек.
OKX_WITHDRAW_DEVIATION = [0.011, 0.011]

# API ключ от OKX.
OKX_API_KEY = "238e7e04-b58c-4f81-bbbb-271374eea2ac"

# Секрет от API ключа от OKX.
OKX_API_SECRET = "238e7e04-b58c-4f81-bbbb-271374eea2ac"

# Пароль от API ключа от OKX.
OKX_API_PASSWORD = "Tolyaos13!"

# Токен для вывода с OKX.
OKX_APTOS_CURRENCY = "APT"

# Сеть для вывода с OKX.
OKX_APTOS_CHAIN = "Aptos"

# Комиссия для вывода с OKX.
OKX_APTOS_WITHDRAWAL_FEE = 0.001

# Количество попыток вывода с OKX, в случае ошибки.
OKX_TOTAL_TRIES = 5

# Количество секунд ожидания перед новой попыткой вывода после ошибочной. Рекомендуем ставить 60.
OKX_SLEEP_TIME_AFTER_ERROR_SEC = 60

# Количество секунд ожидания перед новой попыткой проверки вывода. Рекомендуем ставить 10.
OKX_WAIT_FOR_WITHDRAWAL_FINAL_STATUS_TIME = 10

# Количество попыток проверки успешного вывода. Рекомендуем ставить 100.
OKX_WAIT_FOR_WITHDRAWAL_FINAL_STATUS_ATTEMPTS = 100

# Количество попыток проверки получения средств на кошелек. Рекомендуем ставить 100.
OKX_WAIT_FOR_WITHDRAWAL_RECEIVED_ATTEMPTS = 100

# Количество секунд ожидания перед новой попыткой проверки получения средств на кошелек. Рекомендуем ставить 60.
OKX_WAIT_FOR_WITHDRAWAL_RECEIVED_TIME = 60

# Количество секунд ожидания перед новой попыткой вывода средств с суб аккаунтов на main аккаунт. Рекомендуем ставить 60.
OKX_WAIT_DEPOSIT_TIME = 60
